num_1 = float(input('Введите 1e число: '))
print('int: ' , int(num_1))
print('float: ' , float(num_1))
print('str: ' , str(num_1))
print('bool: ' , bool(num_1))
print('')

num_2 = float(input('Введите 2e число: '))
print('int_str')
print('cумма: ' , int(num_1) + num_2)
print('умножение: ' , int(num_1) * num_2)
print('')

print('int_int')
print(int(num_1) + int(num_2))
print(int(num_1) * int(num_2))
print('')

print('bool_bool')
print(bool(num_1) + bool(num_2))
print(bool(num_1) * bool(num_2))
print('')

print('int_bool')
print(int(num_1) + bool(num_2))
print(int(num_1) * bool(num_2))
print('')

print('float_bool')
print(float(num_1) + bool(num_2))
print(float(num_1) * bool(num_2))
print('')

print('str_str')
print(num_1 + num_2)
print(num_1 * num_2)
print(str(num_1) + str(num_2))
print('')

print('str_bool')
print(str(num_1) * bool(num_2))

# Запросить у пользователя целое число.
# Вывести число в представлении целого числа, вещественного числа, логического значения, строки.
# Запросить у пользователя ещё одно целое число.
# Выполнить операции + и * над всеми вариантами представления первого числа и второго числа, если они допустимы.
